# Pandas

In [36]:
import numpy as np
import pandas as pd

In [37]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [38]:
df = pd.DataFrame(data=data, index=labels)

#### 1. Вывести информацию о датафрейме.

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [40]:
df[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [41]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [42]:
df.iloc[[3, 4, 8], 0 : 2]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

In [43]:
df[['animal', 'age']].iloc[[3, 4, 8]]

  animal  age
d    dog  NaN
e    dog  5.0
i    dog  7.0

#### 5. Выберите строки где количество посещений больше 3.

In [44]:
df[df.visits > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [45]:
df[df.age.isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [46]:
df[(df.animal == 'cat') & (df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [47]:
df[(df.age >= 2) & (df.age <= 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [48]:
df.at['f', 'age'] = 1.5
df.loc['f']

animal      cat
age         1.5
visits        3
priority     no
Name: f, dtype: object

#### 10. Рассчитать общее количество всех посещений.

In [49]:
df.visits.sum()

19

#### 11. Расчитайте суммарный возраст животных

In [50]:
df.age.sum()

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [51]:
df.at['k'] = {'animal': 'cat', 'age': 1, 'visits': 4, 'priority': 'no'}
df

  animal  age  visits priority
a    cat  2.5     1.0      yes
b    cat  3.0     3.0      yes
c  snake  0.5     2.0       no
d    dog  NaN     3.0      yes
e    dog  5.0     2.0       no
f    cat  1.5     3.0       no
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no
k    cat  1.0     4.0       no

In [52]:
df.drop('k', inplace=True)
df

  animal  age  visits priority
a    cat  2.5     1.0      yes
b    cat  3.0     3.0      yes
c  snake  0.5     2.0       no
d    dog  NaN     3.0      yes
e    dog  5.0     2.0       no
f    cat  1.5     3.0       no
g  snake  4.5     1.0       no
h    cat  NaN     1.0      yes
i    dog  7.0     2.0       no
j    dog  3.0     1.0       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [53]:
df.animal.value_counts()

cat      4
dog      4
snake    2
Name: animal, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [54]:
df.sort_values('age', inplace=True)

In [55]:
df.sort_values('visits', inplace=True)

#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [21]:
df.priority = df.priority.apply(lambda x: x.title())
df

  animal  age  visits priority
a    cat  2.5     1.0      Yes
j    dog  3.0     1.0       No
g  snake  4.5     1.0       No
h    cat  NaN     1.0      Yes
c  snake  0.5     2.0       No
e    dog  5.0     2.0       No
i    dog  7.0     2.0       No
f    cat  1.5     3.0       No
b    cat  3.0     3.0      Yes
d    dog  NaN     3.0      Yes

In [58]:
df['priority'] = df['priority'].str.title()
df

  animal  age  visits priority
a    cat  2.5     1.0      Yes
j    dog  3.0     1.0       No
g  snake  4.5     1.0       No
h    cat  NaN     1.0      Yes
c  snake  0.5     2.0       No
e    dog  5.0     2.0       No
i    dog  7.0     2.0       No
f    cat  1.5     3.0       No
b    cat  3.0     3.0      Yes
d    dog  NaN     3.0      Yes

#### 16. В столбце «animal» измените записи «snake» на «python».

In [22]:
def change_name(x):
    return 'python' if x == 'snake' else x

In [23]:
df.animal = df.animal.apply(change_name)
df

   animal  age  visits priority
a     cat  2.5     1.0      Yes
j     dog  3.0     1.0       No
g  python  4.5     1.0       No
h     cat  NaN     1.0      Yes
c  python  0.5     2.0       No
e     dog  5.0     2.0       No
i     dog  7.0     2.0       No
f     cat  1.5     3.0       No
b     cat  3.0     3.0      Yes
d     dog  NaN     3.0      Yes

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [63]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

In [64]:
df.drop(df.index[df.duplicated('A')])

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

In [65]:
df.drop_duplicates(inplace=True)
df

   A
0  1
1  2
3  3
4  4
5  5
8  6
9  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [26]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
df

,a,b,c,d,e,f,g,h,i,j
0,0.921130,0.626768,0.309035,0.738946,0.608831,0.196495,0.070186,0.897066,0.447066,0.910504
1,0.633792,0.105206,0.305829,0.337975,0.524262,0.636276,0.553410,0.242583,0.504714,0.951278
2,0.394957,0.462923,0.187233,0.345599,0.928959,0.812694,0.326997,0.903757,0.424725,0.086624
3,0.975995,0.778341,0.829944,0.418721,0.534067,0.416841,0.000809,0.835489,0.628085,0.276869
4,0.038168,0.154016,0.452896,0.154879,0.276110,0.400435,0.852528,0.375789,0.587715,0.191889

In [27]:
df.sum().idxmin()

'g'

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [28]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})

In [29]:
df.fillna(df.mean(numeric_only=True), inplace=True)
df

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [78]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

In [79]:
df[['From', 'To']] = df.From_To.str.split('_', expand=True)
df.drop(['From_To'], axis=1, inplace=True)
df['From'] = df['From'].apply(lambda x: x.lower().title())
df['To'] = df['To'].apply(lambda x: x.lower().title())

In [80]:
df

   FlightNumber  RecentDelays              Airline      From         To
0       10045.0      [23, 47]               KLM(!)    London      Paris
1           NaN            []    <Air France> (12)    Madrid      Milan
2       10065.0  [24, 43, 87]  (British Airways. )    London  Stockholm
3           NaN          [13]       12. Air France  Budapest      Paris
4       10085.0      [67, 32]          "Swiss Air"  Brussels     London